----------------------------------------------------------------
-- テストデータ
-- $Id: test_data.sql,v 1.7 2006/12/18 07:41:46 w-ota Exp $
----------------------------------------------------------------


-- トランザクション開始
BEGIN;


-- マイページ

-- コミュニティ(マイページ:10)
COPY community FROM stdin;
1000	タロウ	10	\N	f	now	f
1001	イチロウ	10	\N	f	now	f
1002	ジロウ	10	\N	f	now	f
1003	サブロウ	10	\N	f	now	f
1004	シロウ	10	\N	f	now	f
1005	ゴロウ	10	\N	f	now	f
1010	\N	10	\N	f	now	f
\.


-- マイフレンズ

-- コミュニティ(マイフレンズ:20)
COPY community FROM stdin;
2000	\N	20	\N	f	now	f
2001	\N	20	\N	f	now	f
2002	\N	20	\N	f	now	f
2003	\N	20	\N	f	now	f
2004	\N	20	\N	f	now	f
2005	\N	20	\N	f	now	f
2010	\N	20	\N	f	now	f
\.

COPY sub_community FROM stdin;
1000	2000
1001	2001
1002	2002
1003	2003
1004	2004
1005	2005
1010	2010
\.

-- コミュニティ(マイフレンズグループ:30)
COPY community FROM stdin;
3000	友人	30	\N	f	now	f
3010	ボス	30	\N	f	now	f
\.

COPY sub_community FROM stdin;
2000	3000
2000	3010
\.


-- コミュニティ

-- コミュニティ(コミュニティ:40)
COPY community FROM stdin;
4001	A研究室	40	0001	f	2005/10/10	f
4002	Pプロジェクト	40	0005	f	2005/10/10	f
4003	PostgreSQL	40	0017	t	2005/10/10	f
4011	XX勉強会	40	0003	f	2005/10/11	f
4012	YY勉強会	40	0003	f	2005/10/12	f
\.

-- サブコミュニティ設定
COPY sub_community FROM stdin;
4001	4011
4001	4012
4002	4012
\.

-- コンテンツ
COPY contents FROM stdin;
4001	07	ここはA研究室コミュニティです。	01
4002	07	ここはPプロジェクトコミュニティです。	01
4003	07	ここはPostgreSQLコミュニティです。	01
4011	07	ここはXX勉強会コミュニティです。	01
4012	07	ここはYY勉強会コミュニティです。	01
4001	00	\N	01
4002	00	\N	01
4003	00	\N	01
4011	00	\N	03
4012	00	\N	03
4001	31	\N	01
4002	31	\N	01
4003	31	\N	02
4011	31	\N	04
4012	31	\N	04
4001	41	\N	01
4002	41	\N	01
4003	41	\N	04
4011	41	\N	04
4012	41	\N	04
1000	00	\N	01
1000	01	山田太郎	02
1000	02	acs-yamada@xxx.yyy.zz.jp	03
1000	03	情報文化学部	01
1000	04	自然情報学科	01
1000	05	愛知	05
1000	06	1987/01/01	05
1000	07	こんにちは。\nやまだです。(一般向け)	01
1000	08	こんにちは。\nやまだです。(ログインユーザ向け)	02
1000	09	こんにちは。\nやまだです。(友人向け)	05
1000	11	\N	01
1001	00	\N	01
1001	01	鈴木一郎	02
1001	02	acs-suzuki1@xxx.yyy.zz.jp	03
1001	03	情報文化学部	01
1001	04	自然情報学科	01
1001	05	愛知	01
1001	06	1987/01/01	01
1001	07	こんにちは。\nいちろうです。	01
1001	08	こんにちは。\nいちろうです。(ログインユーザ向け)	02
1001	11	\N	01
1002	00	\N	01
1002	01	鈴木二郎	02
1002	02	acs-suzuki2@xxx.yyy.zz.jp	03
1002	03	情報文化学部	01
1002	04	自然情報学科	01
1002	05	愛知	01
1002	06	1987/01/01	01
1002	07	こんにちは。\nじろうです。	01
1002	08	こんにちは。\nじろうです。(ログインユーザ向け)	02
1002	11	\N	01
1003	00	\N	01
1003	01	鈴木三郎	02
1003	02	acs-suzuki3@xxx.yyy.zz.jp	03
1003	03	情報文化学部	01
1003	04	自然情報学科	01
1003	05	愛知	01
1003	06	1987/01/01	01
1003	07	こんにちは。\nさぶろうです。	01
1003	11	\N	01
1004	00	\N	01
1004	01	鈴木四郎	02
1004	02	acs-suzuki4@xxx.yyy.zz.jp	04
1004	03	情報文化学部	01
1004	04	自然情報学科	01
1004	05	愛知	01
1004	06	1987/01/01	01
1004	07	こんにちは。\nしろうです。	01
1004	11	\N	01
1005	00	\N	01
1005	01	鈴木五郎	02
1005	02	acs-suzuki5@xxx.yyy.zz.jp	03
1005	03	情報文化学部	01
1005	04	自然情報学科	01
1005	05	愛知	03
1005	06	1987/01/01	03
1005	07	こんにちは。\nごろうです。	01
1005	11	\N	01
1010	00	\N	03
1010	01	佐藤非公開太郎	02
1010	02	acs-satou@xxx.yyy.zz.jp	03
1010	11	\N	01
\.


-- コンテンツ 信頼済みコミュニティ
COPY contents_trusted_community FROM stdin;
1000	05	05	3000
1000	05	05	3010
1000	06	05	2000
\.


-- コミュニティメンバ(マイフレンズ)
COPY community_member FROM stdin;
2000	1001	\N
2000	1002	\N
2000	1003	\N
2000	1004	\N
2001	1000	\N
2001	1005	\N
2002	1000	\N
2003	1000	\N
2004	1000	\N
2005	1001	\N
\.

-- コミュニティメンバ(マイフレンズのグループ)
COPY community_member FROM stdin;
3000	1002	\N
3000	1003	\N
3010	1004	\N
\.

-- コミュニティメンバ(一般コミュニティ)
COPY community_member FROM stdin;
4001	1000	10
4001	1001	20
4001	1002	20
4001	1003	20
4002	1003	10
4002	1000	20
4003	1001	10
4003	1002	10
4003	1003	20
4011	1000	10
4011	1003	20
4012	1004	10
\.


-- ユーザ情報
COPY user_info FROM stdin;
yamada	1000	f
suzuki1	1001	f
suzuki2	1002	f
suzuki3	1003	f
suzuki4	1004	f
suzuki5	1005	f
satou	1010	f
\.


-- ★ダイアリー
COPY diary FROM stdin;
10001	1000	テスト日記1	これはテスト日記1です。\ntest	now	01	f
10002	1000	テスト日記2	これはテスト日記2です。\ntest	now	02	f
10003	1000	テスト日記3	これはテスト日記3です。\ntest	now	05	f
10004	1000	テスト日記4	これはテスト日記4です。\ntest	now	03	f
10011	1001	テスト日記A	これはテスト日記Aです。\ntest	now	02	f
10021	1002	テスト日記B	これはテスト日記Bです。\ntest	now	01	f
\.

-- ★ダイアリー信頼済み
COPY diary_trusted_community FROM stdin;
10003	2000
\.

-- ★ダイアリーコメント
COPY diary_comment FROM stdin;
10001	10001	1001	これはコメントです。	now	f
10002	10001	1003	これはコメントです。	now	f
10003	10011	1000	これはコメントです。	now	f
10004	10011	1001	これはコメントです。	now	f
10005	10011	1002	これはコメントです。	now	f
10006	10011	1003	これはコメントです。	now	f
\.

-- ★掲示板
COPY bbs FROM stdin;
50010	4001	1000	テスト投稿	これはテスト書き込みです。\ntest1	now	04	\N	f	f
50011	4001	1001	テスト投稿2	これはテスト書き込み2です。\ntest2	now	04	\N	f	f
50012	4001	1001	テスト投稿3	これはテスト書き込み3です。\ntest3	2005/01/02 03:04:05	02	\N	f	f
50015	4001	1001	テストパブリックリリース	これはテストパブリックリリースです。\ntest	now	06	2007-03-31	f	f
50030	4003	1001	テスト投稿	これはテスト書き込みです。\ntest	now	01	\N	f	f
\.

-- ★掲示板返信
COPY bbs_res FROM stdin;
50001	50010	1001	Re: テスト投稿	これは返信です。\nTEST	now	f
50002	50010	1002	Re: テスト投稿	これは返信です。\nTEST	now	f
\.

-- ★掲示板信頼済みコミュニティ
COPY bbs_trusted_community FROM stdin;
50011	4011
50011	4012
\.


-- コミット
COMMIT;
